---
kind: property
id: P:Autodesk.Revit.DB.Color.IsValid
zh: 着色、上色、染色、填色
source: html/8d476082-24da-70be-dc81-3998708ee44f.htm
---
# Autodesk.Revit.DB.Color.IsValid Property

**中文**: 着色、上色、染色、填色

Identifies if the color represents a valid color, or an uninitialized/invalid value.

## Syntax (C#)
```csharp
public bool IsValid { get; }
```